LR11/app/controllers/output_controller.rb

  def output
    sequence = params[:sequence]
    @error = 1
    if sequence == ''
      @output = 'you did not write anything:('
    elsif sequence.to_i.zero?
      @output = 'please, enter a number'
    else
      @output = "Your initial sequence: #{sequence}"
      @error = 0
      if (res = Output.find_by_input(sequence))
        @subsequences = ActiveSupport::JSON.decode(res.result)
        @max = ActiveSupport::JSON.decode(res.max)
      else
        res = find(sequence)
        rising_subsequences = res[0]
        if rising_subsequences.length.zero?
          @subsequences = 'There are no rising subsequences'
          @error = 1
        else
          @subsequences = rising_subsequences
          @max = "maximum length rising subsequence: #{res[1]}"
          res = Output.create input: sequence, result: ActiveSupport::JSON.encode(@subsequences), max: ActiveSupport::JSON.encode(@max)
---
SELECT "outputs".* FROM "outputs" WHERE "outputs"."input" = ? LIMIT ?  [["input", "123451209346"], ["LIMIT", 1]]
INSERT INTO "outputs" ("input", "result", "max", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def results
    respond_to do |format|
      res = Output.all
---
SELECT "outputs".* FROM "outputs"