LR12/app/controllers/output_controller.rb

  def users
    respond_to do |format|
      res = User.all
---
SELECT "users".* FROM "users"