LR12/app/controllers/users_controller.rb

UPDATE "users" SET "username" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "labzunova"], ["password_digest", "$2a$12$QTARONaVdUI9CpWAi36bVusNcVJY021wP35UwkoUywi5FF.BeAHgC"], ["updated_at", "2020-12-15 02:28:24.651111"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)